# Dropping null values on DataFrames

With DataFrames, there will be a few more things to consider, because you can't drop single values. You can only frop entire column or rows.

In [4]:
import pandas as pd
import numpy as np
df= pd.DataFrame({
    'Column A': [1, np.nan, 30, np.nan],
    'Cloumn B': [2,8,31, np.nan],
    'Column C': [np.nan, 9, 32, 100],
    'Column D': [5,8,34,110]
})

In [5]:
df

   Column A  Cloumn B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Column A  2 non-null      float64
 1   Cloumn B  3 non-null      float64
 2   Column C  3 non-null      float64
 3   Column D  4 non-null      int64
dtypes: float64(3), int64(1)
memory usage: 260.0 bytes

In [7]:
df.isnull()

   Column A  Cloumn B  Column C  Column D
0     False     False      True     False
1      True     False     False     False
2     False     False     False     False
3      True      True     False     False

In [8]:
df.isnull().sum()

Column A    2
Cloumn B    1
Column C    1
Column D    0
dtype: int64

In [9]:
df.dropna()

   Column A  Cloumn B  Column C  Column D
2      30.0      31.0      32.0        34

In this case we're dropping rows containing null values from the DF. You can also use the axis parameter to drop columns containing null values.

In [10]:
df.dropna(axis=1)   #axis='columns'

   Column D
0         5
1         8
2        34
3       110

In this case, any row or column that contains at least one null values wi;; be dropped. Which can be, depending on the case, too extreme.You can control this behaviout with the how parameter. ie. is 'any' or 'all'

In [11]:
df2= pd.DataFrame({
    'Column A': [1,np.nan, 30],
    'Column B': [2, np.nan, 31],
    'Column C': [np.nan, np.nan, 100]
})

In [12]:
df2

   Column A  Column B  Column C
0       1.0       2.0       NaN
1       NaN       NaN       NaN
2      30.0      31.0     100.0

In [18]:
df.dropna(how='all')

   Column A  Cloumn B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

ALL= Removes rows where all the values are missing(Nan)

In [14]:
df.dropna(how='any')  #default behaviour

   Column A  Cloumn B  Column C  Column D
2      30.0      31.0      32.0        34

ANY= Removes rows where any value is missing(NaN)

In [15]:
df.dropna(thresh=3)

   Column A  Cloumn B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34

Thresh=3 : Keeps rows that have al least 3 non null or non NaN values.

In [17]:
df.dropna(thresh=3, axis='columns')

   Cloumn B  Column C  Column D
0       2.0       NaN         5
1       8.0       9.0         8
2      31.0      32.0        34
3       NaN     100.0       110

This drops columns instead of rows, based on the threshold of non Nan values.

columns with fewer than 3 non Nan values will be removed.

# Filling null vlaues on DataFrames

In [21]:
df

   Column A  Cloumn B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [26]:
df.fillna({'Column A': 0, 'Column B': 99, 'Column C': df['Column C'].mean()})

   Column A  Cloumn B  Column C  Column D
0       1.0       2.0      47.0         5
1       0.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3       0.0       NaN     100.0       110

NOTE: axis=0 (column direction), axis=1 (row direction)

In [29]:
df.ffill(axis=0)  # Forward fill column-wise

   Column A  Cloumn B  Column C  Column D
0       1.0       2.0      47.0         5
1       0.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3       0.0      31.0     100.0       110

For every missing value in a column, the value above it is used to fill the gap

In [30]:
df.ffill(axis=1)  # Forward fill row-wise

   Column A  Cloumn B  Column C  Column D
0       1.0       2.0      47.0       5.0
1       0.0       8.0       9.0       8.0
2      30.0      31.0      32.0      34.0
3       0.0       0.0     100.0     110.0

For every missing value in a row, the value to its left is used to fill the gap.

# Cleaning NOt null values

In [32]:
df= pd.DataFrame({
    'Sex': ['M','F','F','D','?'],
    'Age': [29,30,24,290,25]
})
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D  290
4   ?   25

## Finding Unique Values

In [33]:
df['Sex'].unique()

array(['M', 'F', 'D', '?'], dtype=object)

In [35]:
df['Sex'].replace('D','F')

0    M
1    F
2    F
3    F
4    ?
Name: Sex, dtype: object

In [36]:
df['Sex'].replace({'D':'F','N':'M'})

0    M
1    F
2    F
3    F
4    ?
Name: Sex, dtype: object

In [37]:
df[df['Age']>100]

  Sex  Age
3   D  290

In [40]:
df.loc[df['Age'] > 100, 'Age'] = df.loc[df['Age'] > 100, 'Age'] / 10
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D   29
4   ?   25